#include"ds1302.h"
#include<intrins.h>
//---DS1302时钟初始化2013年1月1日星期二12点00分00秒。---//
//---存储顺序是秒分时日月周年分（定时）时（定时）定时控制器,存储格式是用BCD码---//
unsigned char TIME[10]={0,0,0x12,0x01,0x01,0x02,0x13,0x00,0x00,0x00};

/*******************************************************************************
*函 数 名:	Ds1302WriteByte
*函数功能:	向DS1302命令（地址+数据）
*输    入:	addr,dat
*输    出:	无
*******************************************************************************/

static void Ds1302WriteByte(unsigned char addr,unsigned char dat)
{
	unsigned char n;
	RST=0;
	SCLK=0;				//先将SCLK置低电平。
	RST=1;				//然后将RST(CE)置高电平。
	for(n=0;n<8;n++)		//开始传送八位地址命令
	{
		DSIO=addr&0x01;		//数据从低位开始传送
		addr>>=1;
		SCLK=1;			//数据在上升沿时，DS1302读取数据
		SCLK=0;
	}
	for(n=0;n<8;n++)		//写入8位数据
	{
		DSIO=dat&0x01;
		dat>>=1;
		SCLK=1;			//数据在上升沿时，DS1302读取数据
		SCLK=0;			//始终先拉低
	}
	RST=0;				//传送数据结束
}

/*******************************************************************************
*函 数 名:	Ds1302ReadByte
*函数功能:	读取一个地址的数据
*输    入:	addr
*输    出:	dat
*******************************************************************************/

static unsigned char Ds1302ReadByte(unsigned char addr)
{
	unsigned char n,dat,dat1;
	RST=0;
	_nop_();
	SCLK=0;				//先将SCLK置低电平。
	_nop_();
	RST=1;				//然后将RST(CE)置高电平。
	for(n=0;n<8;n++)		//开始传送八位地址命令
	{
		DSIO=addr&0x01;		//数据从低位开始传送
		addr>>=1;
		SCLK=1;			//数据在上升沿时，DS1302读取数据
		SCLK=0;			//DS1302下降沿时，放置数据
	}
	for(n=0;n<8;n++)		//读取8位数据
	{
		dat1=DSIO;		//从最低位开始接收
		dat=(dat>>1)|(dat1<<7);
		SCLK=1;
		SCLK=0;			//DS1302下降沿时，放置数据
	}

	RST=0;
	_nop_();			//以下为DS1302复位的稳定时间,必须的。
	SCLK=1;
	_nop_();
	DSIO=0;
	_nop_();
	DSIO=1;
	return(dat);	
}

/*******************************************************************************
*函 数 名:	Ds1302WriteTime
*函数功能:	将时间写入DS1302.
*输    入:	无
*输    出:	无
*******************************************************************************/

extern void Ds1302WriteTime()
{
	unsigned char i;
	Ds1302WriteByte(0x8E,0X00);		//禁止写保护，就是关闭写保护功能
	for(i=0;i<7;i++)			//写入7个字节的时钟信号：分秒时日月周年
	{
		Ds1302WriteByte(0x80+i+i,TIME[i]);
	}
	Ds1302WriteByte(0x8E,0x80);		//打开写保护功能
}

/*******************************************************************************
*函 数 名:	Ds1302ReadTime
*函数功能:	读取时钟信息
*输    入:	无
*输    出:	无
*******************************************************************************/

extern void Ds1302ReadTime()
{
	unsigned char i;
	for(i=0;i<7;i++)			//读取7个字节的时钟信号：分秒时日月周年
	{
		TIME[i]=Ds1302ReadByte(0x81+i+i);
	}
}

#ifdef TIMING
/*******************************************************************************
*函 数 名:	Ds1302WriteTimer
*函数功能:	将定时时间写入DS1302.
*输    入:	无
*输    出:	无
*******************************************************************************/

extern void Ds1302WriteTimer()
{
	Ds1302WriteByte(0x8E,0X00);		//禁止写保护，就是关闭写保护功能
	Ds1302WriteByte(0xC0,TIME[7]);		//写入定时器分钟
	Ds1302WriteByte(0xC2,TIME[8]);		//写入定时器小时
	Ds1302WriteByte(0xC4,TIME[9]);		//写入定时器控制信息
	Ds1302WriteByte(0x8E,0x80);		//打开写保护功能
}

/*******************************************************************************
*函 数 名:	Ds1302ReadTimer
*函数功能:	读取定时信息
*输    入:	无
*输    出:	无
*******************************************************************************/

extern void Ds1302ReadTimer()
{
	TIME[7]=Ds1302ReadByte(0xC1);		//读取定时器分钟
	TIME[8]=Ds1302ReadByte(0xC3);		//读取定时器小时
	TIME[9]=Ds1302ReadByte(0xC5);		//读取定时器控制信息
}
#endif
